Revit 2027 API
BuiltInFailures.SketchFailures.BuildingPadNoSurface Property
 A Pad can't extend beyond the edge of a Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BuildingPadNoSurface { get; }
Public Shared ReadOnly Property BuildingPadNoSurface As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BuildingPadNoSurface {
	FailureDefinitionId^ get ();
}
static member BuildingPadNoSurface : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace